{
  "questions": [
    "Tell me about yourself.",
    "What are your strengths?",
    "What are your weaknesses?",
    "Who was your favorite manager and why?",
    "What kind of personality do you work best with and why?",
    "Why do you want this job?",
    "Where would you like to be in your career five years from now?",
    "Tell me about your proudest achievement.",
    "If you were at a business lunch and you ordered a rare steak and they brought it to you well done, what would you do?",
    "If I were to give you the salary you requested but let you write your job description for the next year, what would it say?",
    "Why is there fuzz on a tennis ball?",
    "How would you quickly establish credibility with a team?",
    "There's no right or wrong answer, but if you could be anywhere in the world right now, where would you be?",
    "How would you feel about working for someone who knows less than you?",
    "Was there a person in your career who really made a difference?",
    "What's your ideal company?",
    "What attracted you to this company?",
    "What are you most proud of?",
    "What are you looking for in terms of career development?",
    "What do you look for in terms of culture -- structured or entrepreneurial?",
    "What do you like to do?",
    "Give examples of ideas you've had or implemented.",
    "What are your lifelong dreams?",
    "What do you ultimately want to become?",
    "How would you describe your work style?",
    "What kind of car do you drive?",
    "Tell me about a time where you had to deal with conflict on the job.",
    "What's the last book you read?",
    "What magazines do you subscribe to?",
    "What would be your ideal working situation?",
    "Why should we hire you?",
    "What did you like least about your last job?",
    "What do you think of your previous boss?",
    "How do you think I rate as an interviewer?",
    "Do you have any questions for me?",
    "When were you most satisfied in your job?",
    "What can you do for us that other candidates can't?",
    "What are three positive things your last boss would say about you?",
    "What negative thing would your last boss say about you?",
    "If you were an animal, which one would you want to be?",
    "What salary are you seeking?",
    "What's your salary history?",
    "Do you have plans to have children in the near future?",
    "What were the responsibilities of your last position?",
    "What do you know about this industry?",
    "What do you know about our company?",
    "How long will it take for you to make a significant contribution?",
    "Are you willing to relocate?",
    "What was the last project you headed up, and what was its outcome?",
    "What kind of goals would you have in mind if you got this job?",
    "Give me an example of a time that you felt you went above and beyond the call of duty at work.",
    "What would you do if you won the lottery?",
    "Can you describe a time when your work was criticized?",
    "Have you ever been on a team where someone was not pulling their own weight? How did you handle it?",
    "What is your personal mission statement?",
    "Tell me about a time when you had to give someone difficult feedback. How did you handle it?",
    "What is your greatest failure, and what did you learn from it?",
    "What irritates you about other people, and how do you deal with it?",
    "What is your greatest fear?",
    "Who has impacted you most in your career, and how?",
    "What do you see yourself doing within the first 30 days of this job?",
    "What's the most important thing you've learned in school?",
    "What three character traits would your friends use to describe you?",
    "What will you miss about your present/last job?",
    "If you were interviewing someone for this position, what traits would you look for?",
    "List five words that describe your character.",
    "What is your greatest achievement outside of work?",
    "Sell me this pencil.",
    "If I were your supervisor and asked you to do something that you disagreed with, what would you do?",
    "Do you think a leader should be feared or liked?",
    "What's the most difficult decision you've made in the last two years?",
    "What do you like to do for fun?",
    "Why are you leaving your present job?",
    "What do you do in your spare time?",
    "How do you feel about taking no for an answer?",
    "What was the most difficult period in your life, and how did you deal with it?",
    "What is your favorite memory from childhood?",
    "Give me an example of a time you did something wrong. How did you handle it?",
    "Tell me one thing about yourself you wouldn't want me to know.",
    "Tell me the difference between good and exceptional.",
    "Why did your choose your major?",
    "What are the qualities of a good leader? A bad leader?",
    "What is your biggest regret, and why?",
    "What are three positive character traits you don't have?",
    "What irritates you about other people, and how do you deal with it?",
    "If you found out your company was doing something against the law, like fraud, what would you do?",
    "How many times do a clock's hands overlap in a day?",
    "How would you weigh a plane without scales?",
    "What assignment was too difficult for you, and how did you resolve the issue?",
    "If I were to ask your last supervisor to provide you additional training or exposure, what would she suggest?",
    "If you could choose one superhero power, what would it be and why?",
    "What's the best movie you've seen in the last year?",
    "Describe how you would handle a situation if you were required to finish multiple tasks by the end of the day, and there was no conceivable way that you could finish them.",
    "What techniques and tools do you use to keep yourself organized?",
    "If you could get rid of any one of the US states, which one would you get rid of, and why?",
    "With your eyes closed, tell me step-by-step how to tie my shoes.",
    "If you had to choose one, would you consider yourself a big-picture person or a detail-oriented person?",
    "If selected for this position, can you describe your strategy for the first 90 days?",
    "Who are your heroes?",
    "Tell me 10 ways to use a pencil other than writing."
  ]
}
